"%@ - Offline" = "%@ Offline-tila";

"3D Secure" = "3D Secure";

"Add New Card…" = "Lisää uusi kortti...";

"Add a Card" = "Lisää kortti";

"Apt." = "Asunto";

"Contact" = "Yhteystiedot";

"Delivery" = "Toimitus";

"Delivery Address" = "Toimitusosoite";

"Free" = "Maksuton";

"Invalid Shipping Address" = "Toimitusosoite ei kelpaa";

"Loading…" = "Lataa...";

"Multibanco" = "Multibanco";

"Next" = "Seuraava";

"Online Banking (FPX)" = "Verkkopankki (FPX)";

"Payment Method" = "Maksutapa";

"Shipping" = "Toimitus";

"Shipping Method" = "Toimitustapa";

"Use Billing" = "Käytä laskutusosoitetta";

"Use Delivery" = "Käytä toimitusosoitetta";

"Use Shipping" = "Käytä lähetysosoitetta";
